[
  {
    "id": 0,
    "title": "How Does Solar Energy Save Money?",
    "description": "Solar energy reduces your utility bills by generating free power from the sun. Over time, the savings on electricity can offset the initial cost of the solar panel system. Additionally, solar panels can increase your home’s value and may qualify you for various tax incentives and rebates, further enhancing your savings.",
    "services": ["solar"]
  },
  {
    "id": 1,
    "title": "Is My Home Suitable For Solar Panels?",
    "description": "Most homes are suitable for solar panels, but factors such as roof condition, orientation, shading, and local climate can affect performance. A solar professional can assess your home’s solar potential and recommend the best setup.",
    "services": ["solar"]
  },
  {
    "id": 2,
    "title": "How Long Do Solar Panels Last?",
    "description": "Solar panels are designed to be durable and can last 25 to 30 years or longer. While their efficiency may decrease slightly over time, they will continue to produce electricity for many years.",
    "services": ["solar"]
  },
  {
    "id": 3,
    "title": "What Happens On Cloudy Days Or At Night?",
    "description": "Solar panels produce less electricity on cloudy days and none at night. However, net metering allows you to use electricity from the grid when solar production is low and earn credits by sending excess solar power back to the grid during peak production times.",
    "services": ["solar"]
  },
  {
    "id": 4,
    "title": "Do Solar Panels Require Maintenance?",
    "description": "Solar panels require minimal maintenance. Keeping them clean and clear of debris helps maintain efficiency. Most systems are also monitored remotely by installers to ensure they operate smoothly.",
    "services": ["solar"]
  },
  {
    "id": 5,
    "title": "Can I Go Off-Grid With Solar Panels?",
    "description": "While possible, going off-grid requires a significant investment in solar panels and battery storage to ensure a reliable power supply. Most homeowners choose a grid-tied system to take advantage of net metering and have a backup power source.",
    "services": ["solar"]
  },
  {
    "id": 6,
    "title": "Are There Incentives For Installing Solar Panels?",
    "description": "Yes, many governments offer tax credits, rebates, and other incentives to reduce the cost of solar installations. These incentives vary by location, so it’s important to research what’s available in your area.",
    "services": ["solar"]
  },
  {
    "id": 7,
    "title": "How Much Does A Solar Panel System Cost?",
    "description": "The cost of a solar panel system varies based on size, location, and other factors. However, falling equipment costs and available incentives have made solar more affordable than ever. A solar provider can give you a detailed quote based on your specific needs.",
    "services": ["solar"]
  },
  {
    "id": 8,
    "title": "What Size Solar System Do I Need?",
    "description": "The size of your solar system depends on your electricity usage, the efficiency of the panels, and how much of your electricity bill you wish to offset. A solar professional can analyze your energy needs and recommend an appropriately sized system.",
    "services": ["solar"]
  },
  {
    "id": 9,
    "title": "How Does Solar Impact The Environment?",
    "description": "Solar energy is a clean, renewable resource that reduces reliance on fossil fuels, decreasing greenhouse gas emissions and pollution. By choosing solar, you’re contributing to a more sustainable and environmentally friendly energy future.",
    "services": ["solar"]
  },
  {
    "id": 10,
    "title": "How Do I Know If My Roof Needs Replacement?",
    "description": "Common signs include missing or curled shingles, visible leaks or water stains inside, excessive granule loss in gutters, and aging (most asphalt roofs last 20–25 years). We perform a free inspection to give you a clear assessment.",
    "services": ["roofing"]
  },
  {
    "id": 11,
    "title": "What Types of Roofing Materials Do You Offer?",
    "description": "We install asphalt shingles (standard and architectural), metal (standing seam, corrugated), slate, tile, and flat‑roof membranes (TPO, EPDM, PVC). Each has its own cost, lifespan, and style benefits.",
    "services": ["roofing"]
  },
  {
    "id": 12,
    "title": "How Long Will My New Roof Installation Take?",
    "description": "Most residential roof replacements finish in 1–3 days, depending on size, material, and weather. We’ll give you an estimated timeline during your free inspection.",
    "services": ["roofing"]
  },
  {
    "id": 13,
    "title": "Do You Handle Insurance Claims for Storm Damage?",
    "description": "Yes—we’ll document damage, work with your adjuster, and manage paperwork so you get the coverage you deserve without the hassle.",
    "services": ["roofing"]
  },
  {
    "id": 14,
    "title": "What Warranties Come with a New Roof?",
    "description": "We offer a workmanship warranty on all installations (typically 5–10 years) plus you’ll get the manufacturer’s warranty on your chosen roofing material, which can be 20–50 years.",
    "services": ["roofing"]
  },
  {
    "id": 15,
    "title": "How Much Does a Roof Replacement Cost?",
    "description": "Costs vary by material, pitch, and square footage. Asphalt shingle roofs often range from $5,000–$15,000; metal or slate runs higher. We provide a no‑obligation, detailed quote after inspection.",
    "services": ["roofing"]
  },
  {
    "id": 16,
    "title": "Can I Finance My Roof Replacement?",
    "description": "Absolutely—ask about our 0%‑interest, no‑payments‑for‑12‑months plan, and low‑credit‑score approval down to 550. We make top‑quality roofs affordable.",
    "services": ["roofing"]
  },
  {
    "id": 17,
    "title": "Will a New Roof Increase My Home’s Value?",
    "description": "Yes—a new roof improves curb appeal, energy efficiency, and resale value. Many buyers see it as a major plus and may pay more for a home with a brand‑new roof.",
    "services": ["roofing"]
  },
  {
    "id": 18,
    "title": "How Do I Maintain My New Roof?",
    "description": "Keep gutters clean, trim overhanging branches, remove debris after storms, and schedule an annual inspection to catch small issues before they become big problems.",
    "services": ["roofing"]
  },
  {
    "id": 19,
    "title": "Do You Offer Flat Roof Waterproofing?",
    "description": "Yes—we install TPO, EPDM, and peel‑and‑stick membranes that provide superior waterproofing and energy savings for low‑slope and flat roofs.",
    "services": ["roofing"]
  }
]
